"""Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме:
название, форма собственности, выручка, издержки.
Необходимо вычислить прибыль каждой компании и среднюю прибыль.
Реализовать список, содержащий словарь (название фирмы и прибыль)
и словарь с одним элементом (средняя прибыль). Добавить в первый словарь еще один элемент,
содержащий результат вычисления отношения прибыли к убыткам. Итоговый список сохранить в файл.
Подсказка: использовать менеджеры контекста."""

